---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedValue
source: html/d1940ac3-3d0a-c94b-05a3-eba1792bdbe9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedValue Property

"Loop animation speed"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyAnimationSpeedValue { get; }
```